
values = ["280001","ГБУЗ АО «Свободненская больница»","171 Свободненская ГБ","Драганер Елена Геннадьевна","г. Свободный, ул. Луговая, д.5","68415008",
    "280002","ГБУЗ АО «Константиновская больница»","341 Константинов ЦРБ","Павленко Светлана Васильевна","","",
    "280003","ГАУЗ АО «Амурская областная клиническая больница»","007 АОКБ","Сатуров Михаил Рюрикович","","",
    "280005","ГАУЗ АО «Амурский областной онкологический диспансер»","015 АООД","Побережский Алексей Валерьевич","","",
    "280007","ГАУЗ АО «Ивановская больница»","321 Ивановская ЦРБ","Самарин Игорь Олегович","Амурская область, Ивановский район, с. Ивановка, пер. Больничный 3","",
    "280012","ГБУЗ АО «Шимановская больница»","231 Шимановская ГБ","Тимшин Олег Геннадьевич","","",
    "280017","ГАУЗ АО «Белогорская больница»","101 Белогорская ГБ","Крупко Виктория Владимировна","","",
    "280019","ГАУЗ АО «Больница рабочего посёлка (п.г.т) Прогресс»","161 Прогресс ГБ","","пгт Прогресс Ленинградская 30","",
    "280020","ГАУЗ АО «Михайловская больница»","391 Михайловская ЦРБ","Альперинова Ольга Андреевна","","",
    "280024","ГБУЗ АО «Архаринская больница»","291 Архаринская ЦРБ","Тараканова Елена Петровна","","",
    "280025","ГБУЗ АО «Селемджинская больница»","421 Экимчан ЦРБ","Шульга Светлана Владимировна","","",
    "280026","ГАУЗ АО «Благовещенская ГКБ»","ГАУЗ АО БГКБ","","","",
    "280027","ГАУЗ АО «Тындинская  больница»","211 Тындинская ГБ","Козлов Андрей Николаевич","","",
    "280028","НУЗ «Отделенческая  больница на ст. Тында ОАО «РЖД»","388 Тында НУЗ","Калинов Евгений Иванович","","",
    "280029","ГБУЗ АО «Магдагачинская больница»","361 Магдагачи ЦРБ","Рыжова Татьяна Николаевна","","",
    "280036","ГАУЗ АО «Городская поликлиника № 1»","029 ГП 1","Cапко Наталья Николаевна","Калинина ул., дом 82","",
    "280038","ГАУЗ АО «Городская поликлиника № 3»","033 ГП 3","Жарновникова Евгения Сергеевна","","",
    "280039","ГБУЗ АО «Мазановская больница»","371 Мазановская ЦРБ","Мельникова Виолетта Алексеевна","","",
    "280043","ГАУЗ АО «Амурская областная детская клиническая больница»","003 АОДКБ","Белоус Руслан Алексеевич","","",
    "280052","ГБУЗ АО «Свободненская  городская поликлиника»","173 Свободненская ГП","Юдина Ирина Владимировна ","","",
    "280053","ГБУЗ АО «Октябрьская больница»","401 Октябрьская ЦРБ","Кравченко Оксана Сергеевна","","",
    "280059","ГБУЗ АО «Сковородинская центральная районная больница»","441 Сковородино ЦРБ","Аюржанаев Максар Александрович","","",
    "280066","ГАУЗ АО «Городская поликлиника № 4»","035 ГП 4","Девяткина Елена Владимировна","","",
    "280067","ГБУЗ АО «Завитинская больница»","311 Завитинская ЦРБ","Марченко Игорь Владимирович","676870, Амурская область, г.Завитинск, ул.Советская 81","01916362",
    "280068","ГБУЗ АО «Бурейская  больница»","301 Бурейская ЦРБ","Тульская Ольга Владимировна","пгт.Новобурейский,ул.Комсомольская,д15","1022800874073",
    "280071","ГБУЗ АО «Ромненская больница»","411 Ромненская ЦРБ","Федченко Тамара Семеновна","676620 Амурская область, Ромненский район, село Ромны, улица Комсомольская 54","",
    "280075","ГБУЗ АО «Райчихинская ГБ»","151 Райчихинская ГБ","Кушнарев Игорь Анатольевич","","",
    "280078","ГБУЗ АО «Серышевская больница»","431 Серышевская ЦРБ","Митина Елена Анатольевна","","",
    "280080","ГАУЗ АО «Тамбовская больница»","461 Тамбовская ЦРБ","Бредюк Нина Кулар-Ооловна","","",
    "280084","ГБУЗ АО «Зейская больница им. Б.Е.Смирнова»","121 Зейская ГБ","Гибадуллин Андрей Равилович","","",
    "280085","ГБУЗ АО «Городская поликлиника № 2»","031 ГП 2","И.О. Добыш Лариса Викторовна","ул. 50 лет Октября, 195/1","",
    "280087","НУЗ «Отделенческая больница на станции Белогорск»","НУЗ «ОБ  на ст. Белогорск»","Ершова Любовь Валентиновна","","",
    "281040","ГБУЗ АО «Амурский медицинский информационо-аналитический центр»","ГБУЗ АО «АМИАЦ»","Отрёпкин Михаил Васильевич","","",
    "284001","НУЗ «Узловая больница на ст. Юктали ОАО «РЖД»","НУЗ на ст. Юктали","Нечипоренко Татьяна Вениаминовна","","",
    "285000","ГБУЗ АО «Амурское бюро судебно-медицинской экспертизы»","041 АБСМЭ","Бокин Александр Николаевич","г.Благовещенск ул.Красноармейская,103","",
    "285001","ФГКУ ""411 ВГ"" МО РФ","ФГКУ ""411 ВГ"" МО РФ","Казиханов Раидин Мирзеахмедович","","",
    "285003","ГБУЗ АО «Амурский областной противотуберкулезный диспансер»","017 АОПТД","Ильин Валерий Витальевич","",""];
if Hospital.count.zero? 
    puts "Hospitals seeding..."
    (values.size / 6).times do        
        Hospital.create(code: values.shift, name: values.shift, shortname: values.shift, boss: values.shift, address: values.shift, po_code: values.shift)
    end 
end    